{
  "chat_tips": "Input command to start chat",
  "languages": "Language",
  "input_key_tips": "Input your api key to access chatgpt",
  "input_proxy_tips": "Input proxy address if needed",
  "done": "Done",
  "cancel": "Cancel",
  "set_key": "Set Api Key",
  "article_content": " War and Peace opens in the Russian city of St. Petersburg in 1805, as Napoleon’s conquest of western Europe is just beginning to stir fears in Russia. Many of the novel’s characters are introduced at a society hostess’s party, among them Pierre Bezukhov, the socially awkward but likeable illegitimate son of a rich count, and Andrew Bolkonski, the intelligent and ambitious son of a retired military commander. We also meet the sneaky and shallow Kuragin family, including the wily father Vasili, the fortune-hunter son Anatole, and the ravishing daughter Helene. We are introduced to the Rostovs, a noble Moscow family, including the lively daughter Natasha, the quiet cousin Sonya, and the impetuous son Nicholas, who has just joined the army led by the old General Kutuzov.\n\nThe Russian troops are mobilized in alliance with the Austrian empire, which is currently resisting Napoleon’s onslaught. Both Andrew and Nicholas go to the front. Andrew is wounded at the Battle of Austerlitz, and though he survives, he is long presumed dead. Pierre is made sole heir of his father’s fortune and marries Helene Kuragina in a daze. Helene cheats on Pierre, and he challenges her seducer to a duel in which Pierre nearly kills the man.\n\nAndrew’s wife, Lise, gives birth to a son just as Andrew arrives home to his estate, much to the shock of his family. Lise dies in childbirth, leaving Andrew’s devout sister Mary to raise the son. Meanwhile, Pierre, disillusioned by married life, leaves his wife and becomes involved with the spiritual practice of Freemasonry. He attempts to apply the practice’s teachings to his estate management, and share these teachings with his skeptical friend Andrew, who is doing work to help reform the Russian government.\n\nMeanwhile, the Rostov family’s fortunes are failing, thanks in part to Nicholas’s gambling debts. The Rostovs consider selling their beloved family estate, Otradnoe. Nicholas is encouraged to marry a rich heiress, despite his earlier promise to marry Sonya. Nicholas’s army career continues, and he witnesses the great peace between Napoleon and Tsar Alexander. Natasha grows up, attends her first ball, and falls in love with various men before becoming seriously attached to Andrew. Andrew’s father objects to the marriage, and requires Andrew to wait a year before wedding Natasha. Natasha reluctantly submits to this demand, and Andrew goes off to travel."
}
